Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<BasedOn>
				<xr:Item>Document.ИнвойсПродажи</xr:Item>
				<xr:Item>Document.ПриходнаяНакладная</xr:Item>
				<xr:Item>Document._ВозвратОтПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыТовара</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.НезакрытыеДокументы</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВДороге</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКонсигнации</xr:Item>
				<xr:Item>AccumulationRegister.ВКД_ПоступлениеСписаниеДС</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрПроцент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагНеПроверятьОстатки</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>счеКонсигнация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУслуг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВозвратов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСЗатратами</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвойсПродажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгрузкуРазрешил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПлюс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентМинус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консигнация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сборщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДляПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>21</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>стрПроцент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>счКонсигнация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУслуг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВозврата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_ЦенаСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_ЦенаСЗатратами</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Привязки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КроссКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док2</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбратныйКурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПредоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РасходнаяНакладная/Ext/ManagerModule.bsl
Процедура ЗаполнитьРеквизиты(Форма) Экспорт
	Форма.ИмяЖурнала = "Расходные накладные";
КонецПроцедуры

Процедура УстановитьВсеПараметры(Форма) Экспорт
КонецПроцедуры

Процедура ПечатьДокумента_(Тек, Поз, Таб, ПоАлфавиту) Экспорт
	Таб.Очистить();
	
	М = Документы.РасходнаяНакладная.ПолучитьМакет("Печать");
	С = Новый Структура;
	гоВставитьКучу(С, "Загол, ИмяПокупателя1, ИмяПокупателя2, ИмяПокупателя3, ИмяПоставщика1, ИмяПоставщика2, ИмяПоставщика3, ИмяПоставщика4, ИмяПоставщика5, ИмяПоставщика6");
	гоВставитьКучу(С, "ИмяСклада, ДопНомера, НомерПП, лНоменклатура, лЕИ, лКоличество, лЦена, лСумма, сКоличество, сБезНДС, сНДС, сСумма, ссСкидка, сСкидка, СтрСНДС,Задолженность");
	гоВставитьКучу(С, "лБезНДС, лНДС, лСкидка, лВалюта, сВалюта, лОплата");
	//2016.04.07
	гоВставитьКучу(С, "лСерия");
	
	С.Загол = "Расходная накладная № " + Тек.Номер + " от " + гоДата(Тек.Дата);
	С.ИмяСклада = СокрЛП(Тек.Склад);
	С.ИмяПоставщика1 = "";
	С.ИмяПоставщика2 = "";
	С.ИмяПоставщика3 = "";
	С.ИмяПоставщика4 = "";
	С.ИмяПоставщика5 = "";
	С.ИмяПоставщика6 = "";
	С.ИмяПокупателя1 = "";
	С.ИмяПокупателя2 = "";
	С.ИмяПокупателя3 = "";

	Если гоНПЗ(Тек.Фирма) Тогда
		С.ИмяПоставщика1 = СокрЛП(Тек.Фирма.ПолнНаименование);
	КонецЕсли;
	
	ДляПечати = СокрЛП(Тек.ДляПечати);
	
	Если ДляПечати = "" Тогда 
		Если гоНПЗ(Тек.Контрагент) Тогда
			С.ИмяПокупателя1 = СокрЛП(Тек.Контрагент.ПолнНаименование);
			Если С.ИмяПокупателя1 = "" Тогда С.ИмяПокупателя1 = СокрЛП(Тек.Контрагент.Наименование) КонецЕсли;
			С.ИмяПокупателя2 = СокрЛП(Тек.Контрагент.Телефоны);
			С.ИмяПокупателя3 = СокрЛП(Тек.Контрагент.Адрес);
		КонецЕсли;
	Иначе 
		С.ИмяПокупателя1 = ДляПечати;
	КонецЕсли; 
	
	Фикс = 4;
	ВывестиСекцию(Таб, М, "ШапкаП1", С); гоПлюс(Фикс);
	Если С.ИмяПоставщика2 <> "" Тогда ВывестиСекцию(Таб, М, "ШапкаП2", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПоставщика3 <> "" Тогда ВывестиСекцию(Таб, М, "ШапкаП3", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПоставщика4 <> "" Тогда ВывестиСекцию(Таб, М, "ШапкаП4", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПоставщика5 <> "" Тогда ВывестиСекцию(Таб, М, "ШапкаП5", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПоставщика6 <> "" Тогда ВывестиСекцию(Таб, М, "ШапкаП6", С); гоПлюс(Фикс); КонецЕсли;
	ВывестиСекцию(Таб, М, "ШапкаК1", С); гоПлюс(Фикс);
	Если С.ИмяПокупателя2 <> "" Тогда ВывестиСекцию(Таб, М, "ШапкаК2", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПокупателя3 <> "" Тогда ВывестиСекцию(Таб, М, "ШапкаК3", С); гоПлюс(Фикс); КонецЕсли;
	
	ВывестиСекцию(Таб, М, "Шапка", С);
	
	Табл = Тек.Товары.Выгрузить();
	// © Primus1C  11.12.2025  НАЧАЛО ►
	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("Ссылка", Тек);
	Запр.Текст = "ВЫБРАТЬ
	             |	РНТовары.Номенклатура КАК Номенклатура,
	             |	РНТовары.Серия КАК Серия,
	             |	РНТовары.ЦенаЗакупки КАК ЦенаЗакупки,
	             |	РНТовары.Количество КАК Количество,
	             |	РНТовары.СуммаЗакупки КАК СуммаЗакупки,
	             |	РНТовары.ДляПечати КАК ДляПечати,
	             |	РНТовары.ЦенаПродажи КАК ЦенаПродажи,
	             |	РНТовары.СуммаПродажи КАК СуммаПродажи,
	             |	РНТовары.стрПроцент КАК стрПроцент,
	             |	РНТовары.счКонсигнация КАК счКонсигнация,
	             |	РНТовары.СуммаУслуг КАК СуммаУслуг,
	             |	РНТовары.ДатаВозврата КАК ДатаВозврата,
	             |	РНТовары.ВКД_ЦенаСоСкидкой КАК ВКД_ЦенаСоСкидкой,
	             |	РНТовары.ВКД_ЦенаСЗатратами КАК ВКД_ЦенаСЗатратами,
	             |	РНТовары.Партия КАК Партия,
	             |	РНТовары.НомерСтроки КАК НомерСтроки
	             |ИЗ
	             |	Документ.РасходнаяНакладная.Товары КАК РНТовары
	             |ГДЕ
	             |	РНТовары.Ссылка = &Ссылка";
	Если ПоАлфавиту Тогда
		Запр.Текст = Запр.Текст + " УПОРЯДОЧИТЬ ПО РНТовары.Номенклатура.Наименование";	
	КонецЕсли;
	Табл = Запр.Выполнить().Выгрузить();
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	//2016.04.07
	Если Поз = 2 Тогда 
		Сабл = Табл.Скопировать();
		Сабл.Свернуть("Номенклатура, ДляПечати, ЦенаПродажи, Серия", "Количество, СуммаЗакупки");
		Сабл.Сортировать("Номенклатура ВОЗР, ДляПечати ВОЗР, ЦенаПродажи ВОЗР, Серия ВОЗР");
		Сабл.Индексы.Добавить("Номенклатура, ДляПечати, ЦенаПродажи");
	КонецЕсли; 
	
	Табл.Свернуть("Номенклатура, ДляПечати, ЦенаПродажи", "Количество, СуммаПродажи");
	
	С.лВалюта = СокрЛП(Тек.Валюта);
	
	ЧислоЗнаковЦена = Тек.Фирма.ЧислоЗнаковЦена;
	
	НомерПП = 0;
	Для Каждого _Табл Из Табл Цикл
		гоПлюс(НомерПП);
		
		ДляПечати = СокрЛП(_Табл.ДляПечати);
		Если ДляПечати = "" Тогда 
			С.лНоменклатура = гоИмя(_Табл.Номенклатура, Ложь);
		Иначе 
			С.лНоменклатура = ДляПечати;
		КонецЕсли; 
		
		С.НомерПП = НомерПП;
		С.лЕИ = "шт.";	//СокрЛП(_Табл.Номенклатура.ЕИ);
		С.лКоличество = _Табл.Количество;
		
		С.лЦена = гоСуммаЗн(_Табл.ЦенаПродажи, ЧислоЗнаковЦена);
		С.лСумма = гоЦена2(_Табл.СуммаПродажи);
		
		ВывестиСекцию(Таб, М, "Строка", С);
		
		//2016.04.07
		Если Поз = 2 Тогда
			Мас = Сабл.НайтиСтроки(Новый Структура("Номенклатура, ДляПечати, ЦенаПродажи", _Табл.Номенклатура, _Табл.ДляПечати, _Табл.ЦенаПродажи));
			Для Каждого _Сабл Из Мас Цикл
				С.лСерия = _Сабл.Серия;
				С.лКоличество = _Сабл.Количество;
				ВывестиСекцию(Таб, М, "СтрокаС", С);
			КонецЦикла; 
		КонецЕсли; 
	КонецЦикла;
	
	С.сКоличество = Табл.Итог("Количество");
	С.сВалюта = С.лВалюта;
	
	лСумПро = Тек.Сумма;
	чСумма = 0;
	чСумма = лСумПро;
	С.сСумма = гоЦена2(чСумма);
	С.сБезНДС = гоЦена2(чСумма);
	С.сНДС = гоЦена2(0);
	С.СтрСНДС = гоСуммаПрописьюВал(чСумма, Тек.Валюта);	// + гоРС() + "Без НДС.";
	
	//+++++++++++++18.11.2019
	//-----------------------
	//+++++++++++++++++++++++
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДолгиОстатки.Валюта,
	               |	ДолгиОстатки.ПокупательОстаток
	               |ИЗ
	               |	РегистрНакопления.Долги.Остатки(
	               |			,
	               |			Контрагент = &Контрагент
	               |				И Фирма = &Фирма) КАК ДолгиОстатки";
	Запрос.УстановитьПараметр("Контрагент",Тек.Контрагент);
	Запрос.УстановитьПараметр("Фирма",Тек.Фирма);
	Выборка = ЗАпрос.Выполнить().Выбрать();
	СтрокаЗадолженность = "Задолженность : ";
	Пока Выборка.Следующий() Цикл
		 СтрокаЗадолженность = СтрокаЗадолженность+ " 
		 | "+ Выборка.ПокупательОстаток + " " + Выборка.Валюта+ ";";	
	 КонецЦикла;
	 С.Задолженность = СтрокаЗадолженность;
	//+++++++++++++++++++++++
	//-----------------------
	//+++++++++++++18.11.2019

	ВывестиСекцию(Таб, М, "Подвал", С);
	
	//глПараметрыСтраницы(Таб, 1);
	//глПовторятьПриПечатиСтроки(Таб, Фикс, Фикс);
КонецПроцедуры

// © Primus1C  06.10.2025  НАЧАЛО ►

#Область Печать
	
Процедура ВывестиСекцию(Таб, Макет, Область, Параметры, Уровень=Неопределено) 
	Ш = Макет.ПолучитьОбласть(Область); 
	Ш.Параметры.Заполнить(Параметры);  
	Если Уровень=Неопределено Тогда
		Таб.Вывести(Ш);
	Иначе
		Таб.Вывести(Ш, Уровень);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СПФ = Новый Структура("БезСерий, ПоСериям, БезСерийПоАлфавиту, ПоСериямПоАлфавиту",  
							НСтр("ru='Расходная накладная (без серий)';en='Sales invoice (no series)'"), 
							НСтр("ru='Расходная накладная (по сериям)';en='Sales invoice (with series)'"),		
							НСтр("ru='Расходная накладная (без серий), алфавитный порядок';en='Sales invoice (no series), alphabetical order'"), 
							НСтр("ru='Расходная накладная (по сериям), алфавитный порядок';en='Sales invoice (with series), alphabetical order'")		
							);		
	Если РольДоступна("Администратор") ИЛИ РольДоступна("Логистика") ИЛИ РольДоступна("Бухгалтерия") ИЛИ РольДоступна("ИнвойсТоварный") ИЛИ РольДоступна("ИнвойсЗакупки") Тогда
		СПФ.Вставить("ПоИнвойсам", НСтр("ru='Расходная накладная (по инвойсам)';en='Sales invoice (invoices)'"));		
		СПФ.Вставить("ПоИнвойсамЗаДень", НСтр("ru='Расходные за день (по инвойсам)';en='Daily sales invoices'"));		
	КонецЕсли;						
							
	Возврат СПФ;						
							
КонецФункции 

Процедура ПечатьДокумента(ДокСсылка, ВариантПечатнойФормы, ТабДокумент, Параметры = 0) Экспорт
	
	Если ВариантПечатнойФормы = "БезСерий" ИЛИ ВариантПечатнойФормы = "ПоСериям" ИЛИ
		ВариантПечатнойФормы = "БезСерийПоАлфавиту" ИЛИ ВариантПечатнойФормы = "ПоСериямПоАлфавиту" Тогда
		
		Если ВариантПечатнойФормы = "БезСерий" ИЛИ ВариантПечатнойФормы = "БезСерийПоАлфавиту" Тогда
			поз = 1;
		Иначе
			поз = 2;
		КонецЕсли;
		ПечатьДокумента_(ДокСсылка, Поз, ТабДокумент, СтрНайти(ВариантПечатнойФормы, "ПоАлфавиту")>0);
		
	Иначе
		
		ТабДокумент.Очистить();  
		Макет = Документы.РасходнаяНакладная.ПолучитьМакет(ВариантПечатнойФормы);
		
		ЗапрШ = Новый Запрос;
		ЗапрШ.УстановитьПараметр("Ссылка", ДокСсылка);
		ЗапрШ.УстановитьПараметр("ПредставлениеДокумента",  ОбщегоНазначения.ПредставлениеДокументаДляПечати(ДокСсылка, ));
		ЗапрШ.Текст = "ВЫБРАТЬ
	             |	Накладная.Номер КАК Номер,
	             |	Накладная.Дата КАК Дата,
	             |	Накладная.Контрагент КАК Контрагент,
	             |	Накладная.Сумма КАК Сумма,
	             |	Накладная.Валюта КАК Валюта,
	             |	Накладная.Склад КАК Склад,
	             |	Накладная.Количество КАК Количество,
	             |	ВЫРАЗИТЬ(Накладная.Примечание КАК СТРОКА(1000)) КАК Примечание,
	             |	&ПредставлениеДокумента КАК ПредставлениеДокумента 
	             |ИЗ
	             |	Документ.РасходнаяНакладная КАК Накладная
	             |ГДЕ
	             |	Накладная.Ссылка = &Ссылка";   
		ОбщегоНазначенияСервер.УстановитьПредставлениеКонтрагентаВЗапросе(ЗапрШ.Текст, "Накладная.Контрагент");	
		Шапка = ЗапрШ.Выполнить().Выбрать();
		Шапка.Следующий(); 
		ВывестиСекцию(ТабДокумент, Макет, "Шапка", Шапка); 
	
		ЗапрИ = Новый Запрос;
		ЗапрИ.Текст = "ВЫБРАТЬ
		              |	РНТовары.Номенклатура КАК Номенклатура,
		              |	РНТовары.Партия.Док.ВКД_Инвойс КАК Инвойс,
		              |	РНТовары.Партия.Док.ВКД_Инвойс.Контрагент КАК Поставщик,
		              |	РНТовары.Партия.Док.ВКД_Инвойс.ВКД_ДатаИнвойсаПоставщика КАК ДатаИнвойса,
		              |	РНТовары.Партия.Док.ВКД_Инвойс.ВКД_НомерИнвойсаПоставщика КАК НомерИнвойсаПоставщика,
		              |	СУММА(РНТовары.Количество) КАК Количество,
		              |	ИнвТовары.Количество КАК КоличествоИнвойс,
		              |	РНТовары.Ссылка.Контрагент КАК Покупатель,
		              |	РНТовары.Ссылка.Валюта КАК Валюта,
		              |	ИнвИтог.Количество КАК ИтКоличествоИнвойс
		              |ИЗ
		              |	Документ.РасходнаяНакладная.Товары КАК РНТовары
		              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		              |			ИнвойсТовары.Ссылка КАК Ссылка,
		              |			ИнвойсТовары.Номенклатура КАК Номенклатура,
		              |			СУММА(ИнвойсТовары.Количество) КАК Количество
		              |		ИЗ
		              |			Документ._Инвойс.ВКД_Товары КАК ИнвойсТовары
		              |		
		              |		СГРУППИРОВАТЬ ПО
		              |			ИнвойсТовары.Ссылка,
		              |			ИнвойсТовары.Номенклатура) КАК ИнвТовары
		              |		ПО РНТовары.Партия.Док.ВКД_Инвойс = ИнвТовары.Ссылка
		              |			И РНТовары.Номенклатура = ИнвТовары.Номенклатура
		              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		              |			СУММА(_ИнвойсВКД_Товары.Количество) КАК Количество,
		              |			_ИнвойсВКД_Товары.Ссылка КАК Ссылка
		              |		ИЗ
		              |			Документ._Инвойс.ВКД_Товары КАК _ИнвойсВКД_Товары
		              |		
		              |		СГРУППИРОВАТЬ ПО
		              |			_ИнвойсВКД_Товары.Ссылка) КАК ИнвИтог
		              |		ПО РНТовары.Партия.Док.ВКД_Инвойс = ИнвИтог.Ссылка
		              |ГДЕ
		              |	РНТовары.Ссылка.Склад = &Склад
		              |	И ВЫБОР
		              |			КОГДА &ЗаДень
		              |				ТОГДА РНТовары.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
		              |			ИНАЧЕ РНТовары.Ссылка = &Ссылка
		              |		КОНЕЦ
		              |
		              |СГРУППИРОВАТЬ ПО
		              |	РНТовары.Номенклатура,
		              |	РНТовары.Партия.Док.ВКД_Инвойс,
		              |	РНТовары.Партия.Док.ВКД_Инвойс.Контрагент,
		              |	РНТовары.Партия.Док.ВКД_Инвойс.Дата,
		              |	РНТовары.Партия.Док.ВКД_Инвойс.ВКД_НомерИнвойсаПоставщика,
		              |	ИнвТовары.Количество,
		              |	РНТовары.Ссылка.Контрагент,
		              |	РНТовары.Ссылка.Валюта,
		              |	ИнвИтог.Количество
		              |
		              |УПОРЯДОЧИТЬ ПО
		              |	Поставщик,
		              |	НомерИнвойсаПоставщика,
		              |	Номенклатура
		              |АВТОУПОРЯДОЧИВАНИЕ";
		ОбщегоНазначенияСервер.УстановитьПредставлениеКонтрагентаВЗапросе(ЗапрИ.Текст, "РНТовары.Партия.Док.ВКД_Инвойс.Контрагент");	
		ЗапрИ.УстановитьПараметр("Ссылка", ДокСсылка);
		ЗапрИ.УстановитьПараметр("Склад", ДокСсылка.Склад);
		ЗапрИ.УстановитьПараметр("Дата", ДокСсылка.Дата);
		ЗапрИ.УстановитьПараметр("ЗаДень", ВариантПечатнойФормы = "ПоИнвойсамЗаДень");
		
		ИтКоличество = 0; 
		Ном = 0;
		ВыборкаИ = ЗапрИ.Выполнить().Выбрать();
		Пока ВыборкаИ.Следующий() Цикл     
			ИтКоличество = ИтКоличество + ВыборкаИ.Количество;  
			Ном = Ном + 1;
			//ОбластьДно.Параметры.Ном = Ном;
			ВывестиСекцию(ТабДокумент, Макет, "Строка", ВыборкаИ); 
		КонецЦикла;
		
		ОбластьДно = Макет.ПолучитьОбласть("Дно");
		ОбластьДно.Параметры.Заполнить(Шапка);
		ОбластьДно.Параметры.ИтКоличество = ИтКоличество;
		//ОбластьДно.Параметры.СуммаПрописью = гоСуммаПрописьюВал(Шапка.Сумма, Шапка.Валюта);
		ТабДокумент.Вывести(ОбластьДно);
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

// переделать на функцию общ.модуля проведениеДокументов !!!
//
Функция ЗатратыПартий(МассивПартий) Экспорт

	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Партии", МассивПартий);
	Запр.Текст = "ВЫБРАТЬ
	             |	Затраты.Партия КАК Партия,
	             |	СУММА(Затраты.Сумма) КАК Сумма
	             |ИЗ
	             |	РегистрСведений.Затраты КАК Затраты
	             |ГДЕ
	             |	Затраты.Партия В(&Партии)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Затраты.Партия
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Свод.Партия КАК Партия,
	             |	СУММА(Свод.Сумма) КАК Сумма
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		Партии.Ссылка КАК Партия,
	             |		Партии.Владелец КАК Номенклатура,
	             |		Партии.Док.ВКД_Инвойс КАК Инвойс,
	             |		Партии.Док.Поставка КАК Поставка,
	             |		ЗатратыИнв.Сумма КАК Сумма
	             |	ИЗ
	             |		Справочник.Партии КАК Партии
	             |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |				Затраты.Сумма КАК Сумма,
	             |				Затраты.Номенклатура КАК Номенклатура,
	             |				Затраты.Инвойс КАК Инвойс,
	             |				Затраты.Поставка КАК Поставка
	             |			ИЗ
	             |				РегистрСведений.Затраты КАК Затраты
	             |			ГДЕ
	             |				(Затраты.Номенклатура, Затраты.Инвойс, Затраты.Поставка, Затраты.Партия) В
	             |						(ВЫБРАТЬ
	             |							П.Владелец,
	             |							П.Док.ВКД_Инвойс,
	             |							П.Док.Поставка,
	             |							ЗНАЧЕНИЕ(Справочник.Партии.ПустаяСсылка)
	             |						ИЗ
	             |							Справочник.Партии КАК П
	             |						ГДЕ
	             |							П.Ссылка В (&Партии))) КАК ЗатратыИнв
	             |			ПО Партии.Владелец = ЗатратыИнв.Номенклатура
	             |				И Партии.Док.ВКД_Инвойс = ЗатратыИнв.Инвойс
	             |				И Партии.Док.Поставка = ЗатратыИнв.Поставка
	             |	ГДЕ
	             |		Партии.Ссылка В(&Партии)) КАК Свод
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Свод.Партия";
	Пакет = Запр.ВыполнитьПакет();
	ВыборкаПартии = Пакет[0].Выбрать();  
	СоотвЗатратыПартии = Новый Соответствие;
	Пока ВыборкаПартии.Следующий() Цикл
		СоотвЗатратыПартии.Вставить(ВыборкаПартии.Партия, ВыборкаПартии.Сумма);		
	КонецЦикла;
	ВыборкаПартииИнв = Пакет[1].Выбрать(); 
	СоотвПартииИнв = Новый Соответствие;
	Пока ВыборкаПартииИнв.Следующий() Цикл
		СоотвПартииИнв.Вставить(ВыборкаПартииИнв.Партия, ВыборкаПартииИнв.Сумма);		
	КонецЦикла;
	
	Возврат Новый Структура("ЗатратыПартии, ЗатратыПартииИнвойсов", СоотвЗатратыПартии, СоотвПартииИнв);
	
КонецФункции 

// © Primus1C  ОКОНЧАНИЕ ◄
